jpc007/stm32n6570-dk-first/AppliSecure/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32n6xx_hal_cortex.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define VECT_TAB_NS_OFFSET  0x00400
#define VTOR_TABLE_NS_START_ADDR (SRAM2_AXI_BASE_NS|VECT_TAB_NS_OFFSET)
#define VTOR_TABLE_S_START_ADDR  (SRAM2_AXI_BASE_S |VECT_TAB_NS_OFFSET)

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void NonSecure_Init(void);
static void SystemIsolation_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* --- Boot trace via USART2 (configure par FSBL, registres persistent) --- */
static void boot_trace_putc(char c)
{
    while (!(USART2->ISR & USART_ISR_TXE_TXFNF)) {}
    USART2->TDR = (uint8_t)c;
}
static void boot_trace(const char *s)
{
    while (*s) boot_trace_putc(*s++);
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  /* ==== EARLY DIAG : boot_trace avant HAL_Init ==== */
  /* USART2 toujours configure par FSBL (registres persistent apres jump) */
  boot_trace("\r\n--- AppliSecure: Reset_Handler OK ---\r\n");
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/
  HAL_Init();

  /* USER CODE BEGIN Init */
  boot_trace("[AppliSecure] HAL_Init OK\r\n");
  /* USER CODE END Init */

  /* USER CODE BEGIN SysInit */
  boot_trace("[AppliSecure] before SystemIsolation_Config\r\n");
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  SystemIsolation_Config();
  /* USER CODE BEGIN 2 */

  /* ============================================================
   * BOOT STAGE 2 : LED JAUNE (PE9) puis LED ROUGE (PH5) — pauses courtes
   * (meme idee que la pause ecran FSBL, plus rapide sur les LED).
   * USART2 configure par FSBL (registres persistent apres jump).
   * SysTick tourne (HAL_SuspendTick pas encore appele).
   * ============================================================ */
  {
    GPIO_InitTypeDef gpio = {0};
    gpio.Mode  = GPIO_MODE_OUTPUT_PP;
    gpio.Pull  = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;

    /* LED JAUNE (PE9) — GPIOE clock deja ON (SystemIsolation_Config) */
    gpio.Pin = GPIO_PIN_9;
    HAL_GPIO_Init(GPIOE, &gpio);
    HAL_GPIO_WritePin(GPIOE, GPIO_PIN_9, GPIO_PIN_SET);

    boot_trace("=== [2/3 AppliSecure] LED JAUNE ===\r\n");
    HAL_Delay(200);
    HAL_GPIO_WritePin(GPIOE, GPIO_PIN_9, GPIO_PIN_RESET);

    /* LED ROUGE (PH5) — GPIOH clock deja ON (SystemIsolation_Config) */
    gpio.Pin = GPIO_PIN_5;
    HAL_GPIO_Init(GPIOH, &gpio);
    HAL_GPIO_WritePin(GPIOH, GPIO_PIN_5, GPIO_PIN_SET);

    boot_trace("=== [2/3 AppliSecure] LED ROUGE ===\r\n");
    HAL_Delay(200);
    HAL_GPIO_WritePin(GPIOH, GPIO_PIN_5, GPIO_PIN_RESET);

    boot_trace("=== [2/3 AppliSecure] -> NonSecure ===\r\n");
  }

  /* USER CODE END 2 */

  /* Secure SysTick should rather be suspended before calling non-secure  */
  /* in order to avoid wake-up from sleep mode entered by non-secure      */
  /* The Secure SysTick shall be resumed on non-secure callable functions */
  HAL_SuspendTick();

  /*************** Setup and jump to non-secure *******************************/

  NonSecure_Init();

  /* Non-secure software does not return, this code is not executed */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief  Non-secure call function
  *         This function is responsible for Non-secure initialization and switch
  *         to non-secure state
  * @retval None
  */
static void NonSecure_Init(void)
{
  funcptr_NS NonSecure_ResetHandler;

  SCB_NS->VTOR = VTOR_TABLE_NS_START_ADDR;

  /* Read vector table via NS alias (0x24100400).
   * RISAF3 is now configured NSEC → S alias (0x34100400) is BLOCKED.
   * Secure CPU can read NS memory via NS alias without issue. */
  uint32_t ns_msp   = (*(uint32_t *)VTOR_TABLE_NS_START_ADDR);
  uint32_t ns_reset = (*((uint32_t *)((VTOR_TABLE_NS_START_ADDR) + 4U)));

  boot_trace("[NS] VTOR=0x");
  { char h[9]; uint32_t v=VTOR_TABLE_NS_START_ADDR; for(int i=7;i>=0;i--){uint8_t n=(v>>(i*4))&0xF;h[7-i]=n<10?'0'+n:'A'+n-10;}h[8]=0;boot_trace(h); }
  boot_trace(" MSP=0x");
  { char h[9]; uint32_t v=ns_msp; for(int i=7;i>=0;i--){uint8_t n=(v>>(i*4))&0xF;h[7-i]=n<10?'0'+n:'A'+n-10;}h[8]=0;boot_trace(h); }
  boot_trace(" RST=0x");
  { char h[9]; uint32_t v=ns_reset; for(int i=7;i>=0;i--){uint8_t n=(v>>(i*4))&0xF;h[7-i]=n<10?'0'+n:'A'+n-10;}h[8]=0;boot_trace(h); }
  boot_trace("\r\n");

