jpc007/stm32n6570-dk-first/AppliSecure/Core/Src/main.c
  /* ---------------------------------------------------------------
   * Configurations NON generees par CubeMX — doivent rester ici.
   * Survivent a la regeneration car dans USER CODE.
   * --------------------------------------------------------------- */

  /* 1) RISUP NSEC pour peripheriques AppliNonSecure
   *    (CubeMX ne genere que des RISUP SEC pour le FSBL) */
  boot_trace("[RIF2] 1-RISUP...\r\n");
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_USART2,
                                        RIF_ATTRIBUTE_NSEC | RIF_ATTRIBUTE_NPRIV);
  /* LTDC/LTDCL1/LTDCL2 : forcer SEC+PRIV (comme BSP) pour que le DMA LTDC
   * puisse acceder SRAM3 via l'alias Secure 0x34200000. */
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDC,
                                        RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL1,
                                        RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);
  HAL_RIF_RISC_SetSlaveSecureAttributes(RIF_RISC_PERIPH_INDEX_LTDCL2,
                                        RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV);

  boot_trace("[RIF2] 1-RISUP OK\r\n");

  /* 2) RIMC master : LTDC L1 + L2 DMA avec CID=1, SEC+PRIV
   *    Le DMA LTDC doit acceder la SRAM3 via l'alias Secure (0x34200000)
   *    car l'acces NS a SRAM3 est bloque par l'interconnect NoC.
   *    Comme l'exemple BSP ST : LTDC master = SEC + PRIV. */
  {
    RIMC_MasterConfig_t ltdc_master = {0};
    ltdc_master.MasterCID = RIF_CID_1;
    ltdc_master.SecPriv   = RIF_ATTRIBUTE_SEC | RIF_ATTRIBUTE_PRIV;
    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC1, &ltdc_master);
    HAL_RIF_RIMC_ConfigMasterAttributes(RIF_MASTER_INDEX_LTDC2, &ltdc_master);
    __DSB();
  }

  boot_trace("[RIF2] 2-RIMC OK\r\n");

  /* 3) GPIOQ — LCD_ON (PQ3) et backlight (PQ6)
   *    (CubeMX ne genere aucun code pour GPIOQ) */
  __HAL_RCC_GPIOQ_CLK_ENABLE();
  HAL_GPIO_ConfigPinAttributes(GPIOQ, GPIO_PIN_3, GPIO_PIN_NSEC | GPIO_PIN_NPRIV);
  HAL_GPIO_ConfigPinAttributes(GPIOQ, GPIO_PIN_6, GPIO_PIN_NSEC | GPIO_PIN_NPRIV);

  /* 4) Pins LCD ignores par CubeMX — doivent etre NSEC pour AppliNonSecure */
  /* PA15 (LTDC_R5) et PB4 (LTDC_R3) — JTAG alias, absents du .ioc */
  HAL_GPIO_ConfigPinAttributes(GPIOA, GPIO_PIN_15, GPIO_PIN_NSEC | GPIO_PIN_NPRIV);
  HAL_GPIO_ConfigPinAttributes(GPIOB, GPIO_PIN_4,  GPIO_PIN_NSEC | GPIO_PIN_NPRIV);

  /* PB13 (LCD_CLK) — CRITIQUE : pixel clock ! Absent du .ioc.
   * Sans ce flag NSEC, le HAL_GPIO_Init depuis AppliNonSecure est
   * SILENCIEUSEMENT IGNORE par TrustZone → pas de clock pixel → ecran noir */
  HAL_GPIO_ConfigPinAttributes(GPIOB, GPIO_PIN_13, GPIO_PIN_NSEC | GPIO_PIN_NPRIV);

  /* PE1 (LCD_NRST) — reset panneau LCD, absent du .ioc */
  HAL_GPIO_ConfigPinAttributes(GPIOE, GPIO_PIN_1,  GPIO_PIN_NSEC | GPIO_PIN_NPRIV);

  /* PG0 (LCD_R0) — absent du .ioc (R0 = LSB rouge, non utilise en RGB565
   * mais doit quand meme etre NSEC pour eviter un fault si on y accede) */
  HAL_GPIO_ConfigPinAttributes(GPIOG, GPIO_PIN_0,  GPIO_PIN_NSEC | GPIO_PIN_NPRIV);

  /* 4b) Debug board LEDs — explicitement NSEC pour que les fault handlers NS
   *     puissent signaler les erreurs sans double-fault */
  HAL_GPIO_ConfigPinAttributes(GPIOD, GPIO_PIN_0,  GPIO_PIN_NSEC | GPIO_PIN_NPRIV); /* GREEN  */
  HAL_GPIO_ConfigPinAttributes(GPIOE, GPIO_PIN_9,  GPIO_PIN_NSEC | GPIO_PIN_NPRIV); /* YELLOW */
  HAL_GPIO_ConfigPinAttributes(GPIOH, GPIO_PIN_5,  GPIO_PIN_NSEC | GPIO_PIN_NPRIV); /* RED    */
  HAL_GPIO_ConfigPinAttributes(GPIOE, GPIO_PIN_10, GPIO_PIN_NSEC | GPIO_PIN_NPRIV); /* BLUE   */
  HAL_GPIO_ConfigPinAttributes(GPIOE, GPIO_PIN_13, GPIO_PIN_NSEC | GPIO_PIN_NPRIV); /* WHITE  */

  boot_trace("[RIF2] 4-GPIO OK\r\n");

  /* 5) RISAF4 — ouvrir SRAM3+SRAM4 en NS pour le framebuffer LTDC
   *    RISAF4 protege NPU port 0 = SRAM3(0x24200000)+SRAM4(0x24270000)
   *    Espace d'adresse = 4 GB → adresses absolues dans STARTR/ENDR
   *    On utilise Region 1 (index 0 dans le tableau REG[]) */

  /* 5a) Activer RISAF (AHB3) + RAMCFG (AHB2) horloges */
  boot_trace("[5a] RISAF+RAMCFG clk\r\n");
  __HAL_RCC_RISAF_CLK_ENABLE();
  __HAL_RCC_RAMCFG_CLK_ENABLE();
  __DSB();

  /* 5b) Activer SRAM3/SRAM4 horloges memoire.
   *     Utilisation de CMSIS direct dans les deux alias (S et NS) car le
   *     mecanisme exact de protection RCC varie selon le state TZ. */
  boot_trace("[5b] MEMENSR\r\n");
  RCC_S->MEMENSR = RCC_MEMENR_AXISRAM3EN | RCC_MEMENR_AXISRAM4EN;
  __DSB();
  /* Fallback : forcer aussi via ENR direct */
  if (!(RCC_S->MEMENR & (RCC_MEMENR_AXISRAM3EN | RCC_MEMENR_AXISRAM4EN)))
  {
    RCC_S->MEMENR |= (RCC_MEMENR_AXISRAM3EN | RCC_MEMENR_AXISRAM4EN);
    __DSB();
  }
  /* Rendre TOUTES les ressources RCC publiques (NS accessible) via PUBCFGR.
   * Sans cela, le code NS ne peut pas activer les clocks GPIO, USART, etc. */
  boot_trace("[5b] PUBCFGR ALL\r\n");
  RCC_S->PUBCFGR0 = 0xFFFFFFFFU;  /* oscillators */
  RCC_S->PUBCFGR1 = 0xFFFFFFFFU;  /* PLLs */
  RCC_S->PUBCFGR2 = 0xFFFFFFFFU;  /* dividers (IC16...) */
  RCC_S->PUBCFGR3 = 0xFFFFFFFFU;  /* CCIPR peripherals mux */
  RCC_S->PUBCFGR4 = 0xFFFFFFFFU;  /* bus clocks (AHB1-5, APB1-5) */
  RCC_S->PUBCFGR5 = 0xFFFFFFFFU;  /* memory clocks (SRAMs) */
  __DSB();

  /* 5c) Sortir SRAM3/SRAM4 du mode shutdown via RAMCFG */
  boot_trace("[5c] RAMCFG\r\n");
  CLEAR_BIT(RAMCFG_SRAM3_AXI_S->CR, RAMCFG_CR_SRAMSD);
  CLEAR_BIT(RAMCFG_SRAM4_AXI_S->CR, RAMCFG_CR_SRAMSD);
  __DSB();

  /* 5c2) RISAF3 — Ouvrir SRAM2 en NS pour AppliNonSecure
   *      RISAF3 protege AXISRAM2 (0x24100000-0x241FFFFF).
   *      Par defaut aucun acces NS n'est autorise → le CPU NS ne peut
   *      ni fetcher les instructions ni ecrire sur la stack → IBUSERR.
   *      On configure une region couvrant tout SRAM2 en NSEC, tous CIDs. */
  boot_trace("[5c2] RISAF3 SRAM2\r\n");
  {
    RISAF_TypeDef *risaf3 = RISAF3_S;

    /* Diagnostic : afficher CR */
    {
      volatile uint32_t cr = risaf3->CR;
      boot_trace("[5c2] CR=0x");
      char h[9]; for(int i=7;i>=0;i--){uint8_t n=(cr>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0;
      boot_trace(h); boot_trace("\r\n");
    }

