jpc007/stm32n6570-dk-first/AppliSecure/Core/Src/main.c
    /* Desactiver region 0 avant configuration */
    risaf3->REG[0].CFGR = 0;
    __DSB();

    /* Effacer les flags d'acces illegaux */
    risaf3->IACR = risaf3->IASR;
    __DSB();

    /* Region 0 : couvre tout l'espace SRAM2 */
    risaf3->REG[0].STARTR  = 0x00000000UL;   /* debut relatif */
    risaf3->REG[0].ENDR    = 0xFFFFFFFFUL;   /* tout l'espace */
    risaf3->REG[0].CIDCFGR = 0x00FF00FFU;    /* tous CIDs R+W */
    /* CFGR: BREN=1 (enable), SEC=0 (NSEC) → acces NS autorise */
    risaf3->REG[0].CFGR    = RISAF_REGx_CFGR_BREN;
    __DSB();
    boot_trace("[5c2] RISAF3 OK\r\n");
  }

  /* 5d) RISAF4 — differe a la section 7 (apres remplissage FB via alias S,
   *     avant activation LTDC). NPU clock active ici car requis pour ecriture. */
  boot_trace("[5d] RISAF4 => sec7\r\n");
  __HAL_RCC_NPU_CLK_ENABLE();
  __DSB();

  /* 5e) RISAF2 — TEMPORAIREMENT DESACTIVE pour debug */
  boot_trace("[5e] RISAF2 SKIP\r\n");
#if 0
  {
    RISAF_TypeDef *risaf2 = RISAF2_S;

    risaf2->REG[0].CFGR = 0;
    __DSB();
    risaf2->IACR = risaf2->IASR;
    __DSB();
  }
#endif

  /* 5f) MPU non-secure : framebuffer LTDC (SRAM3 0x24200000, 800x480x2) en non-cacheable.
   *     Le CM55 ecrit souvent dans le D-cache ; le LTDC lit l'AXI/SRAM hors cache.
   *     Sans cette region, seul BCCR (registre) est correct — layer FB = noir. */
  boot_trace("[5e] RISAF2 OK\r\n");
#if defined(HAL_CORTEX_MODULE_ENABLED) && defined(MPU_NS)
  boot_trace("[5f] MPU NS\r\n");
  {
    MPU_Attributes_InitTypeDef mpu_attr = {0};
    MPU_Region_InitTypeDef     mpu_reg  = {0};
    const uint32_t fb_base = 0x24200000UL;
    const uint32_t fb_size = 800UL * 480UL * 2UL;

    mpu_attr.Number     = MPU_ATTRIBUTES_NUMBER0;
    mpu_attr.Attributes = INNER_OUTER(MPU_NOT_CACHEABLE);
    HAL_MPU_ConfigMemoryAttributes_NS(&mpu_attr);

    mpu_reg.Enable            = MPU_REGION_ENABLE;
    mpu_reg.Number            = MPU_REGION_NUMBER7;
    mpu_reg.AttributesIndex   = MPU_ATTRIBUTES_NUMBER0;
    mpu_reg.BaseAddress       = fb_base;
    mpu_reg.LimitAddress      = fb_base + fb_size - 1UL;
    mpu_reg.AccessPermission  = MPU_REGION_ALL_RW;
    mpu_reg.DisableExec       = MPU_INSTRUCTION_ACCESS_DISABLE;
    mpu_reg.DisablePrivExec   = MPU_PRIV_INSTRUCTION_ACCESS_DISABLE;
    mpu_reg.IsShareable       = MPU_ACCESS_OUTER_SHAREABLE;
    HAL_MPU_ConfigRegion_NS(&mpu_reg);

    /* Fond de carte memoire NS + HF/NMI : le reste de la NS garde les attributs par defaut */
    HAL_MPU_Enable_NS(MPU_HFNMI_PRIVDEF);
  }

  /* 5f2) MPU Secure : alias S du framebuffer (0x34200000) en non-cacheable.
   *      Le remplissage du FB se fait depuis le Secure via l'alias S.
   *      Sans cette region, les ecritures vont dans le D-cache Secure
   *      (background region = cacheable) et n'atteignent jamais la SRAM.
   *      Le LTDC DMA et le CPU NS lisent la SRAM directement → ecran noir. */
  boot_trace("[5f2] MPU S FB\r\n");
  {
    MPU_Attributes_InitTypeDef mpu_attr = {0};
    MPU_Region_InitTypeDef     mpu_reg  = {0};
    const uint32_t fb_base_s = 0x34200000UL;
    const uint32_t fb_size   = 800UL * 480UL * 2UL;

    mpu_attr.Number     = MPU_ATTRIBUTES_NUMBER1;  /* index 1 pour S MPU */
    mpu_attr.Attributes = INNER_OUTER(MPU_NOT_CACHEABLE);
    HAL_MPU_ConfigMemoryAttributes(&mpu_attr);     /* Secure MPU */

    mpu_reg.Enable            = MPU_REGION_ENABLE;
    mpu_reg.Number            = MPU_REGION_NUMBER6;  /* region 6 pour S */
    mpu_reg.AttributesIndex   = MPU_ATTRIBUTES_NUMBER1;
    mpu_reg.BaseAddress       = fb_base_s;
    mpu_reg.LimitAddress      = fb_base_s + fb_size - 1UL;
    mpu_reg.AccessPermission  = MPU_REGION_ALL_RW;
    mpu_reg.DisableExec       = MPU_INSTRUCTION_ACCESS_DISABLE;
    mpu_reg.IsShareable       = MPU_ACCESS_OUTER_SHAREABLE;
    HAL_MPU_ConfigRegion(&mpu_reg);                /* Secure MPU */

    HAL_MPU_Enable(MPU_HFNMI_PRIVDEF);
  }
#endif

  boot_trace("[RIF2] 5-RISAF OK\r\n");

  /* 6) LTDC clock configuration — MUST be done from Secure context
   *    (IC16CFGR, DIVENSR, CCIPR4, APB5ENSR are Secure-only RCC registers,
   *     writes from NS are silently ignored without PUBCFGR bits) */

  /* 6a) Pixel clock : IC16 = PLL1 (1200 MHz) / 45 = 26.67 MHz */
  MODIFY_REG(RCC_S->IC16CFGR,
             RCC_IC16CFGR_IC16SEL | RCC_IC16CFGR_IC16INT,
             (0U  << RCC_IC16CFGR_IC16SEL_Pos) |   /* source = PLL1 */
             (44U << RCC_IC16CFGR_IC16INT_Pos));    /* divider-1 = 44 -> /45 */
  SET_BIT(RCC_S->DIVENSR, RCC_DIVENSR_IC16ENS);    /* enable IC16 */
  while (!(RCC_S->DIVENR & RCC_DIVENR_IC16EN)) {}  /* wait enabled */

  /* 6b) LTDC kernel clock source = IC16 */
  MODIFY_REG(RCC_S->CCIPR4, RCC_CCIPR4_LTDCSEL,
             RCC_CCIPR4_LTDCSEL_1);                 /* LTDCSEL = 10 = IC16 */

  /* 6c) LTDC peripheral clock (APB5) */
  RCC_S->APB5ENSR = RCC_APB5ENR_LTDCEN;
  __DSB();
  while (!(RCC_S->APB5ENR & RCC_APB5ENR_LTDCEN)) {}

  /* 6d) LTDC peripheral reset APRES clock enable (sequence BSP officielle) */
  RCC_S->APB5RSTSR = RCC_APB5RSTR_LTDCRST;   /* assert reset */
  for (volatile int _d = 0; _d < 100; _d++) {} /* brief delay */
  RCC_S->APB5RSTCR = RCC_APB5RSTR_LTDCRST;   /* release reset */
  __DSB();

  boot_trace("[RIF2] 6-CLK OK\r\n");

  /* ================================================================
   * 7) LTDC FULL INIT FROM SECURE
   *    Les ecritures NS vers LTDC_NS sont silencieusement ignorees
   *    (CFBAR reste a 0 apres write depuis NS). On programme donc
   *    TOUT ici avec les alias _S, puis NS n'a plus qu'a ecrire
   *    dans le framebuffer (SRAM3 0x24200000, deja NSEC).
   * ================================================================ */
  {
    /* --- 7a) GPIO AF14 pour toutes les broches LCD (comme LTDC_MspInit BSP) --- */
    GPIO_InitTypeDef gpio = {0};

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
    __HAL_RCC_GPIOE_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();
    __HAL_RCC_GPIOH_CLK_ENABLE();
    __HAL_RCC_GPIOQ_CLK_ENABLE();

    gpio.Mode      = GPIO_MODE_AF_PP;
    gpio.Pull      = GPIO_NOPULL;
    gpio.Speed     = GPIO_SPEED_FREQ_HIGH;

    /* PA0 R1, PA1 G0, PA2 B0, PA7 B1, PA8 G1, PA15 R5 */
    gpio.Pin       = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_7|GPIO_PIN_8|GPIO_PIN_15;
    gpio.Alternate = GPIO_AF14_LCD;
    HAL_GPIO_Init(GPIOA, &gpio);

    /* PB2 G4, PB4 R3, PB11 G5, PB12 G6, PB13 CLK, PB14 VSYNC, PB15 B7 */
    gpio.Pin       = GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_2|GPIO_PIN_4|GPIO_PIN_11|GPIO_PIN_12|GPIO_PIN_15;
    gpio.Alternate = GPIO_AF14_LCD;
    HAL_GPIO_Init(GPIOB, &gpio);

    /* PD8 B6, PD9 B3, PD15 R7 */
    gpio.Pin       = GPIO_PIN_8|GPIO_PIN_9|GPIO_PIN_15;
    gpio.Alternate = GPIO_AF14_LCD;
    HAL_GPIO_Init(GPIOD, &gpio);

    /* PE11 HSYNC */
    gpio.Pin       = GPIO_PIN_11;
    gpio.Alternate = GPIO_AF14_LCD;
    HAL_GPIO_Init(GPIOE, &gpio);

    /* PG0 R0, PG1 R2, PG6 R4, PG8 G2, PG11 B2, PG12 G3 */
    gpio.Pin       = GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_6|GPIO_PIN_8|GPIO_PIN_11|GPIO_PIN_12;
    gpio.Alternate = GPIO_AF14_LCD;
    HAL_GPIO_Init(GPIOG, &gpio);

    /* PH3 B4, PH4 R4, PH6 B5 */
    gpio.Pin       = GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_6;
    gpio.Alternate = GPIO_AF14_LCD;
    HAL_GPIO_Init(GPIOH, &gpio);

    /* --- 7b) LCD power / backlight / DE / NRST (sorties PP) --- */
    gpio.Mode  = GPIO_MODE_OUTPUT_PP;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    gpio.Pull  = GPIO_NOPULL;

