jpc007/stm32n6570-dk-first/AppliSecure/Core/Src/main.c
    /* PQ3 LCD_ON, PQ6 LCD_BL_CTRL */
    gpio.Pin = GPIO_PIN_3|GPIO_PIN_6;
    HAL_GPIO_Init(GPIOQ, &gpio);
    HAL_GPIO_WritePin(GPIOQ, GPIO_PIN_3, GPIO_PIN_SET);
    HAL_GPIO_WritePin(GPIOQ, GPIO_PIN_6, GPIO_PIN_SET);

    /* PG13 LCD_DE (Display Enable) — avec pull-up comme BSP_LCD_DisplayOn */
    gpio.Pin  = GPIO_PIN_13;
    gpio.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOG, &gpio);
    HAL_GPIO_WritePin(GPIOG, GPIO_PIN_13, GPIO_PIN_SET);

    /* PE1 LCD_NRST — cycle reset panneau */
    gpio.Pin  = GPIO_PIN_1;
    gpio.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOE, &gpio);
    HAL_GPIO_WritePin(GPIOE, GPIO_PIN_1, GPIO_PIN_RESET);
    HAL_Delay(2);
    HAL_GPIO_WritePin(GPIOE, GPIO_PIN_1, GPIO_PIN_SET);
    HAL_Delay(120);

    /* --- 7c) Programmer les registres LTDC via alias Secure --- */
    LTDC_TypeDef       *ltdc  = LTDC_S;
    LTDC_Layer_TypeDef *layer = LTDC_Layer1_S;

    /* Diagnostic : adresses LTDC + PPSR protection status */
    {
      boot_trace("[7c] LTDC_S=0x");
      { uint32_t v=(uint32_t)ltdc; char h[9]; for(int i=7;i>=0;i--){uint8_t n=(v>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace(" L1_S=0x");
      { uint32_t v=(uint32_t)layer; char h[9]; for(int i=7;i>=0;i--){uint8_t n=(v>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");

      /* PPSR3 = protection status pour REG3 (ou se trouve LTDC/LTDCL1/LTDCL2) */
      volatile uint32_t ppsr3 = RIFSC_S->PPSRx[3];
      boot_trace("[7c] PPSR3=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(ppsr3>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");

      /* SEC + PRIV status */
      volatile uint32_t sec3  = RIFSC_S->RISC_SECCFGRx[3];
      volatile uint32_t priv3 = RIFSC_S->RISC_PRIVCFGRx[3];
      volatile uint32_t lock3 = RIFSC_S->RISC_RCFGLOCKRx[3];
      boot_trace("[7c] SEC3=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(sec3>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace(" PRV3=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(priv3>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace(" LCK3=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(lock3>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");

      /* Test ecriture shadow + per-layer reload :
       * Sur N6, la lecture CFBAR renvoie le registre ACTIF (pas shadow).
       * Ecrire shadow → IMR reload → relire actif = valeur ecrite. */
      layer->CFBAR = 0xDEADBEEFU;
      __DSB();
      layer->RCR = LTDC_LxRCR_IMR;   /* per-layer reload shadow → actif */
      __DSB();
      while ((layer->RCR & LTDC_LxRCR_IMR) != 0U) {}
      volatile uint32_t cfbar_test = layer->CFBAR;
      boot_trace("[7c] WR CFBAR=DEADBEEF IMR RD=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(cfbar_test>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");
      /* Remettre CFBAR shadow a 0 pour la suite */
      layer->CFBAR = 0U;
      layer->RCR = LTDC_LxRCR_IMR;
      __DSB();
      while ((layer->RCR & LTDC_LxRCR_IMR) != 0U) {}
    }

    ltdc->GCR &= ~LTDC_GCR_LTDCEN;
    __DSB();
    ltdc->GCR = 0U;
    __DSB();

    LTDC_Layer1_S->CR    = 0U;
    LTDC_Layer1_S->CFBAR = 0U;
    LTDC_Layer1_S->BFCR  = 0U;
    LTDC_Layer2_S->CR    = 0U;
    LTDC_Layer2_S->CFBAR = 0U;
    LTDC_Layer2_S->BFCR  = 0U;

    /* RK050HR18 : 800x480, HSYNC/HBP/HFP/VSYNC/VBP/VFP = 4 */
    const uint32_t w = 800U, h = 480U;
    const uint32_t hsw = 4U, hbp = 4U, hfp = 4U;
    const uint32_t vsw = 4U, vbp = 4U, vfp = 4U;

    uint32_t accum_hbp = hsw + hbp - 1U;
    uint32_t accum_vbp = vsw + vbp - 1U;
    uint32_t accum_aw  = hsw + w + hbp - 1U;
    uint32_t accum_ah  = vsw + h + vbp - 1U;
    uint32_t total_w   = hsw + w + hbp + hfp - 1U;
    uint32_t total_h   = vsw + h + vbp + vfp - 1U;

    ltdc->SSCR = ((hsw - 1U) << LTDC_SSCR_HSW_Pos) | ((vsw - 1U) << LTDC_SSCR_VSH_Pos);
    ltdc->BPCR = (accum_hbp << LTDC_BPCR_AHBP_Pos) | (accum_vbp << LTDC_BPCR_AVBP_Pos);
    ltdc->AWCR = (accum_aw  << LTDC_AWCR_AAW_Pos)  | (accum_ah  << LTDC_AWCR_AAH_Pos);
    ltdc->TWCR = (total_w   << LTDC_TWCR_TOTALW_Pos)| (total_h   << LTDC_TWCR_TOTALH_Pos);

    /* HSPOL/VSPOL/DEPOL = active-low (0), PCPOL = IPC (inverted) */
    ltdc->GCR = LTDC_GCR_BCKEN | LTDC_GCR_PCPOL;
    ltdc->BCCR = 0x00000000U;

    uint32_t h_start = accum_hbp + 1U;
    uint32_t h_stop  = accum_hbp + w;
    uint32_t v_start = accum_vbp + 1U;
    uint32_t v_stop  = accum_vbp + h;

    layer->WHPCR  = (h_start << 0) | (h_stop << 16);
    layer->WVPCR  = (v_start << 0) | (v_stop << 16);
    layer->PFCR   = 4U;           /* RGB565 sur N6 (PF=4, pas 2 comme ancien STM32!) */
    layer->CACR   = 0xFFU;        /* alpha constant = opaque */
    layer->DCCR   = 0x00000000U;
    layer->BFCR   = (0x06U << LTDC_LxBFCR_BF1_Pos) | (0x07U << LTDC_LxBFCR_BF2_Pos);
    layer->CFBAR  = 0x34200000U;  /* framebuffer SRAM3 (adresse S car DMA LTDC = SEC+PRIV) */
    layer->CFBLR  = ((w * 2U) << 16) | ((w * 2U) + 7U);
    layer->CFBLNR = h;

    /* Diagnostic immediat : les ecritures Layer ont-elles ete acceptees ? */
    {
      volatile uint32_t cfbar_chk = LTDC_Layer1_S->CFBAR;
      volatile uint32_t whpcr_chk = LTDC_Layer1_S->WHPCR;
      volatile uint32_t pfcr_chk  = LTDC_Layer1_S->PFCR;
      volatile uint32_t cr_chk    = LTDC_Layer1_S->CR;
      (void)cr_chk;
      boot_trace("[7c] PFCR=0x");
      { uint32_t v=pfcr_chk; char h[9]; for(int i=7;i>=0;i--){uint8_t n=(v>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace(" (4=RGB565)\r\n");
      boot_trace("[7c] CFBAR=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(cfbar_chk>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace(" WHPCR=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(whpcr_chk>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");
    }

    /* --- 7d1) Configurer RISAF4 NSEC AVANT le remplissage FB. */
    {
      RISAF_TypeDef *risaf4 = RISAF4_S;

      /* Meme sequence que RISAF3 qui fonctionne : disable → IACR → config → enable */
      risaf4->REG[0].CFGR = 0U;   /* disable region 0 */
      __DSB();
      risaf4->IACR = risaf4->IASR; /* clear pending violations */
      __DSB();

      risaf4->REG[0].STARTR  = 0x00000000UL;
      risaf4->REG[0].ENDR    = 0xFFFFFFFFUL;
      risaf4->REG[0].CIDCFGR = 0x00FF00FFU;
      risaf4->REG[0].CFGR    = RISAF_REGx_CFGR_BREN;
      __DSB();

