jpc007/stm32n6570-dk-first/AppliSecure/Core/Src/main.c
      /* Readback RISAF4 pour verification */
      volatile uint32_t r4_cfgr = risaf4->REG[0].CFGR;
      volatile uint32_t r4_cid  = risaf4->REG[0].CIDCFGR;
      volatile uint32_t r4_sr   = risaf4->REG[0].STARTR;
      volatile uint32_t r4_er   = risaf4->REG[0].ENDR;
      boot_trace("[7d1] R4 CFGR=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(r4_cfgr>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace(" CID=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(r4_cid>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");
      boot_trace("[7d1] SR=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(r4_sr>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace(" ER=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(r4_er>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");
    }

    /* --- 7d) Remplir le framebuffer avec du BLANC (RGB565 = 0xFFFF) ---
     *    Utilise l'alias S (0x34200000) qui est maintenant non-cacheable
     *    grace a la MPU Secure (section 5f2). Les ecritures vont
     *    directement en SRAM, pas de D-cache flush necessaire. */
    {
      volatile uint16_t *fb_s = (volatile uint16_t *)0x34200000UL;
      /* Ecrire un pattern reconnaissable : premiers pixels = 0xA5A5 */
      fb_s[0] = 0xA5A5U;
      fb_s[1] = 0x5A5AU;
      fb_s[2] = 0xFFFFU;
      __DSB();

      /* Test immediat : relire via S et NS */
      volatile uint16_t test_s0  = *(volatile uint16_t *)0x34200000UL;
      volatile uint16_t test_ns0 = *(volatile uint16_t *)0x24200000UL;
      volatile uint16_t test_s1  = *(volatile uint16_t *)0x34200002UL;
      volatile uint16_t test_ns1 = *(volatile uint16_t *)0x24200002UL;

      boot_trace("[7d] S[0]=0x");
      { uint32_t v=test_s0; char h[5]; for(int i=3;i>=0;i--){uint8_t n=(v>>(i*4))&0xF; h[3-i]=n<10?'0'+n:'A'+n-10;} h[4]=0; boot_trace(h); }
      boot_trace(" NS[0]=0x");
      { uint32_t v=test_ns0; char h[5]; for(int i=3;i>=0;i--){uint8_t n=(v>>(i*4))&0xF; h[3-i]=n<10?'0'+n:'A'+n-10;} h[4]=0; boot_trace(h); }
      boot_trace(" S[1]=0x");
      { uint32_t v=test_s1; char h[5]; for(int i=3;i>=0;i--){uint8_t n=(v>>(i*4))&0xF; h[3-i]=n<10?'0'+n:'A'+n-10;} h[4]=0; boot_trace(h); }
      boot_trace(" NS[1]=0x");
      { uint32_t v=test_ns1; char h[5]; for(int i=3;i>=0;i--){uint8_t n=(v>>(i*4))&0xF; h[3-i]=n<10?'0'+n:'A'+n-10;} h[4]=0; boot_trace(h); }
      boot_trace("\r\n");

      /* Verifier si RISAF4 a un flag d'acces illegal apres lecture NS */
      volatile uint32_t r4_iasr = RISAF4_S->IASR;
      boot_trace("[7d] R4 IASR=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(r4_iasr>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");

      /* Remplir le reste en blanc */
      for (uint32_t i = 3; i < w * h; i++) {
        fb_s[i] = 0xFFFFU;
      }
      __DSB();
    }

    /* --- 7e) Activer layer 1 + LTDC + rechargement immediat --- */
    layer->CR = LTDC_LxCR_LEN;   /* shadow : LEN=1 */

    /* Activer LTDC (requis avant per-layer reload) */
    ltdc->GCR |= LTDC_GCR_LTDCEN;
    __DSB();

    /* Per-layer immediate reload (comme HAL_LTDC_ConfigLayer sur STM32N6).
     * Sur N6, chaque layer a un RCR avec IMR (bit 0) = trigger direct.
     * SRCR global ne fonctionne PAS si GRMSK est actif dans le RCR actif
     * (valeur reset possiblement GRMSK=1, et RCR est shadow aussi).
     * IMR transfere shadow → actif pour tous les registres de ce layer. */
    layer->RCR = LTDC_LxRCR_IMR;   /* IMR=1, GRMSK=0 */
    __DSB();
    /* IMR est auto-clear par hardware apres reload */
    while ((layer->RCR & LTDC_LxRCR_IMR) != 0U) {}  /* attendre fin reload */

    /* --- 7f) Diagnostic Secure : verifier FB + LTDC apres config --- */
    {
      /* Lire LTDC registres via S alias */
      volatile uint32_t gcr_s  = LTDC_S->GCR;
      volatile uint32_t srcr_s = LTDC_S->SRCR;
      (void)srcr_s;
      volatile uint32_t cfbar_s = LTDC_Layer1_S->CFBAR;
      volatile uint32_t cr_s    = LTDC_Layer1_S->CR;
      volatile uint32_t whpcr_s = LTDC_Layer1_S->WHPCR;
      volatile uint32_t cfblr_s = LTDC_Layer1_S->CFBLR;

      boot_trace("[7f] GCR_S=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(gcr_s>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");
      boot_trace("[7f] CFBAR_S=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(cfbar_s>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");
      boot_trace("[7f] CR_S=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(cr_s>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");
      boot_trace("[7f] WHPCR_S=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(whpcr_s>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");
      boot_trace("[7f] CFBLR_S=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(cfblr_s>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");

      /* Verifier FB via NS alias (0x24200000) et S alias (0x34200000) */
      volatile uint16_t fb_ns = *(volatile uint16_t *)0x24200000UL;
      volatile uint16_t fb_s  = *(volatile uint16_t *)0x34200000UL;
      boot_trace("[7f] FB@NS=0x");
      { uint32_t v=fb_ns; char h[5]; for(int i=3;i>=0;i--){uint8_t n=(v>>(i*4))&0xF; h[3-i]=n<10?'0'+n:'A'+n-10;} h[4]=0; boot_trace(h); }
      boot_trace(" FB@S=0x");
      { uint32_t v=fb_s; char h[5]; for(int i=3;i>=0;i--){uint8_t n=(v>>(i*4))&0xF; h[3-i]=n<10?'0'+n:'A'+n-10;} h[4]=0; boot_trace(h); }
      boot_trace("\r\n");
    }
  }

  /* 7f2) Diagnostic LTDC scanning + erreurs DMA.
   *      Apres 50 ms (~3 frames a 60fps), verifier :
   *      - TERRIF (bit 2) : erreur bus DMA → LTDC ne peut pas lire le FB
   *      - FUWIF  (bit 1) : underrun warning FIFO
   *      - FUIF   (bit 6) : underrun fatal FIFO
   *      - CPSR   : position scan (doit changer entre 2 lectures) */
  {
    /* Mettre BCCR vert vif pour distinguer du noir si le layer DMA echoue */
    LTDC_S->BCCR = 0x0000FF00U;  /* RRGGBB : vert */
    __DSB();

    HAL_Delay(50);

