jpc007/stm32n6570-dk-first/AppliSecure/Core/Src/main.c
    volatile uint32_t isr1   = LTDC_S->ISR;
    volatile uint32_t cpsr1  = LTDC_S->CPSR;
    HAL_Delay(2);
    volatile uint32_t cpsr2  = LTDC_S->CPSR;

    boot_trace("[7f2] ISR=0x");
    { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(isr1>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
    boot_trace("\r\n");
    boot_trace("[7f2] CPSR1=0x");
    { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(cpsr1>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
    boot_trace(" CPSR2=0x");
    { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(cpsr2>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
    boot_trace("\r\n");

    if (isr1 & (1UL << 2))  boot_trace("[7f2] *** TERRIF: DMA bus error! ***\r\n");
    if (isr1 & (1UL << 1))  boot_trace("[7f2] *** FUWIF: FIFO underrun warn ***\r\n");
    if (isr1 & (1UL << 6))  boot_trace("[7f2] *** FUIF: FIFO underrun fatal ***\r\n");
    if (cpsr1 == cpsr2)      boot_trace("[7f2] *** CPSR stuck — not scanning ***\r\n");
    else                     boot_trace("[7f2] LTDC scanning OK\r\n");

    /* 7f3) Diagnostic GPIO : verifier que les pins LCD sont en AF14
     *      et que le backlight / power sont effectivement HIGH.
     *      PB13 (LCD_CLK) = le plus critique — si pas AF14, pas de pixel clock */
    {
      /* GPIOB : PB13 = LCD_CLK
       *   MODER[27:26] doit etre 10 (AF)
       *   AFR[1] bits [23:20] doivent etre 0xE (=14=AF14) */
      volatile uint32_t pb_moder = GPIOB_S->MODER;
      volatile uint32_t pb_afrh  = GPIOB_S->AFR[1]; /* AFRH pour pin 8-15 */
      /* PB14 = LCD_HSYNC : MODER[29:28]=10, AFR[1][27:24]=0xE */
      boot_trace("[7f3] PB MODER=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(pb_moder>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace(" AFRH=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(pb_afrh>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");

      uint32_t pb13_mode = (pb_moder >> 26) & 0x3;
      uint32_t pb13_af   = (pb_afrh >> 20)  & 0xF;
      if (pb13_mode != 2 || pb13_af != 14)
        boot_trace("[7f3] *** PB13(CLK) NOT AF14! ***\r\n");
      else
        boot_trace("[7f3] PB13(CLK) = AF14 OK\r\n");

      /* PE11 = LCD_VSYNC : MODER[23:22]=10, AFR[1][15:12]=0xE */
      volatile uint32_t pe_moder = GPIOE_S->MODER;
      volatile uint32_t pe_afrh  = GPIOE_S->AFR[1];
      uint32_t pe11_mode = (pe_moder >> 22) & 0x3;
      uint32_t pe11_af   = (pe_afrh >> 12) & 0xF;
      if (pe11_mode != 2 || pe11_af != 14)
        boot_trace("[7f3] *** PE11(VSYNC) NOT AF14! ***\r\n");
      else
        boot_trace("[7f3] PE11(VSYNC) = AF14 OK\r\n");

      /* PG13 = LCD_DE : MODER[27:26]=01 (OUTPUT) voulue, ODR bit13=1 */
      volatile uint32_t pg_moder = GPIOG_S->MODER;
      volatile uint32_t pg_odr   = GPIOG_S->ODR;
      uint32_t pg13_mode = (pg_moder >> 26) & 0x3;
      if (pg13_mode != 1)
        boot_trace("[7f3] *** PG13(DE) NOT OUTPUT! ***\r\n");
      else if (!(pg_odr & (1U << 13)))
        boot_trace("[7f3] *** PG13(DE) OUTPUT but LOW! ***\r\n");
      else
        boot_trace("[7f3] PG13(DE) = OUT HIGH OK\r\n");

      /* PQ3 = LCD_ON, PQ6 = LCD_BL : ODR */
      volatile uint32_t pq_moder = GPIOQ_S->MODER;
      volatile uint32_t pq_odr   = GPIOQ_S->ODR;
      boot_trace("[7f3] PQ MODER=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(pq_moder>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace(" ODR=0x");
      { char h[9]; for(int i=3;i>=0;i--){uint8_t n=(pq_odr>>(i*4))&0xF; h[3-i]=n<10?'0'+n:'A'+n-10;} h[4]=0; boot_trace(h); }
      boot_trace("\r\n");
      if (!(pq_odr & (1U << 3)))  boot_trace("[7f3] *** PQ3(LCD_ON) LOW! ***\r\n");
      if (!(pq_odr & (1U << 6)))  boot_trace("[7f3] *** PQ6(LCD_BL) LOW! ***\r\n");
      if ((pq_odr & ((1U<<3)|(1U<<6))) == ((1U<<3)|(1U<<6)))
        boot_trace("[7f3] PQ3+PQ6 HIGH OK\r\n");

      /* RIMC: verifier attributs LTDC1 master */
      volatile uint32_t rimc1 = RIFSC_S->RIMC_ATTRx[RIF_MASTER_INDEX_LTDC1];
      boot_trace("[7f3] RIMC_LTDC1=0x");
      { char h[9]; for(int i=7;i>=0;i--){uint8_t n=(rimc1>>(i*4))&0xF; h[7-i]=n<10?'0'+n:'A'+n-10;} h[8]=0; boot_trace(h); }
      boot_trace("\r\n");
    }

    /* Attendre 2s pour observer l'ecran avant le saut NS */
    boot_trace("[7f2] Waiting 2s - observe screen...\r\n");
    HAL_Delay(2000);
  }

  /* [7f4] Demo visuelle 100 % Secure (meme FB @0x34200000 que le LTDC).
   *      Si aucune couleur pendant 3 s : panneau / timings / signalisation,
   *      pas LVGL ni le NSC. Si OK : la chaine LTDC+RAM+panneau est saine. */
  {
    volatile uint16_t *fb = (volatile uint16_t *)0x34200000UL;
    const uint32_t       W = 800U;
    const uint32_t       H = 480U;
    const uint16_t       cols[4] = {0xF800U, 0x07E0U, 0x001FU, 0xFFE0U}; /* R G B Jaune */
    uint32_t             band = H / 4U;

    if (band == 0U) {
      band = 1U;
    }
    for (uint32_t y = 0; y < H; y++) {
      uint16_t c   = cols[(y / band) & 3U];
      uint32_t row = y * W;
      for (uint32_t x = 0; x < W; x++) {
        fb[row + x] = c;
      }
    }
    __DSB();
    LTDC_S->BCCR = 0x00000000U;
    __DSB();
    boot_trace("[7f4] DEMO bandes RGBY sur FB Secure 3s\r\n");
    HAL_Delay(3000);
  }

  /* 7g) LTDC reste SEC : le DMA LTDC fonctionne en SEC+PRIV pour acceder
   *     SRAM3 via l'alias Secure 0x34200000. Si on bascule en NSEC, le DMA
   *     ne pourrait plus lire le framebuffer (acces NS a SRAM3 bloque).
   *     AppliNonSecure accede LTDC via NSC veneers si necessaire. */
  boot_trace("[7g] LTDC stays SEC\r\n");

  boot_trace("[RIF2] 7-LTDC OK\r\n");

  /* USER CODE END RIF_Init 2 */

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* NON-BLOQUANT : __BKPT(0) sans debugger = HardFault.
   * On trace et on continue pour ne pas bloquer la chaine de boot. */
  boot_trace("[AppliSecure] ERROR_HANDLER!\r\n");
  __NOP();
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
